<?php

return [

    '北海道' => ['道南', '道央', '道北', '道東'],

    '青森県' => ['津軽', '南部', '下北', '中南', '東青'],
    '岩手県' => ['県央', '県南', '沿岸', '県北'],
    '宮城県' => ['三陸', '県北', '仙台・松島', '県南',],
    '秋田県' => ['秋田', '湯沢', '大館', '由利本荘', '大仙・仙北'],
    '山形県' => ['村山', '最上', '置賜', '庄内'],
    '福島県' => ['会津', '中通り', '浜通り'],

    '新潟県' => ['村上', '新潟', '燕三条', '長岡', '湯沢', '妙高・上越', '佐渡'],
    '山梨県' => ['清里・韮崎', '甲府', '石和・勝沼', '大月・都留', '南アルプス', '富士山麓'],
    '長野県' => ['北信', '中信（日本アルプス）', '東信', '南信'],

    '茨城県' => ['県北', '県央', '鹿行', '県南', '県西'],
    '栃木県' => ['日光', '那須', '県央', '県南', '県東'],
    '群馬県' => ['利根沼田', '吾妻', '西部', '県央', '東部'],
    '埼玉県' => ['秩父', '西部', '中央', '東部', '北部'],
    '千葉県' => ['ベイ（千葉）', '葛飾', '北総', '九十九里', '南房総', 'かずさ'],
    '東京都' => ['都心部', '副都心', 'ベイ（東京）', '西部', '多摩', '島しょ部'],
    '神奈川県' => ['横浜・川崎', '丹波', '湘南', '三浦半島', '箱根', '足柄'],

    '富山県' => ['富山', '氷見・高岡', '富山湾湾岸', '黒部・立山', '砺波'],
    '石川県' => ['能登', '金沢', '加賀', '白山'],
    '福井県' => ['福井', '坂井・あわら', '永平寺町・奥越', '丹南', '若狭路'],

    '岐阜県' => ['飛騨', '東濃', '中濃', '岐阜', '西濃'],
    '静岡県' => ['伊豆', '東部', '中部', '西部'],
    '愛知県' => ['名古屋', '尾張北部', '尾張西部', '知多', '西三河', '東三河'],
    '三重県' => ['北勢', '伊賀', '中南勢', '伊勢志摩', '東紀州'],

    '滋賀県' => ['湖西', '湖南・大津', '甲賀', '湖東', '湖北'],
    '奈良県' => ['奈良', '飛鳥・橿原', '生駒・斑鳩', '吉野路'],
    '和歌山県' => ['和歌山', '高野山', '熊野古道', '白浜', '那智勝浦'],
    '京都府' => ['洛中', '洛東', '洛西', '洛南', '洛北', '海の京都'],
    '大阪府' => ['キタ', 'ミナミ', '天王寺・阿倍野', '大阪城', 'ベイ（大阪）', '北部', '東部', '南部', '大阪市近郊'],
    '兵庫県' => ['摂津', '播磨', '但馬', '丹波', '淡路'],

    '鳥取県' => ['因幡', '倉敷・東伯', '西部'],
    '島根県' => ['松江・安来', '出雲', '雲南', '石見銀山', '浜田', '津和野', '隠岐'],
    '岡山県' => ['岡山', '倉敷', '美作', '備中', '備前・瀬戸内'],
    '広島県' => ['宮島・廿日市', '広島市', '尾道・福山', '東広島・呉・竹原'],
    '山口県' => ['関門', '山口', '萩・北浦', '周防'],

    '徳島県' => ['東部', '南部', '西部'],
    '香川県' => ['東讃', '中讃', '西讃', '小豆島', '直島・豊島'],
    '愛媛県' => ['中予', '東予', '南予'],
    '高知県' => ['高知市', '仁淀川', '物部川・嶺北', '安芸・室戸', '四万十・足摺'],

    '福岡県' => ['北九州', '福岡', '筑後', '筑豊'],
    '佐賀県' => ['東部', '北西部', '中部', '西部', '南部'],
    '長崎県' => ['長崎', '佐世保', '諫早・大村', '雲仙・島原', '五島列島', '壱岐・対馬'],
    '熊本県' => ['熊本市', '阿蘇', '県北', '県央', '県南', '天草'],
    '大分県' => ['別府湾', 'やまなみ', '宇佐・国東', '日田・耶馬渓', '大保川'],
    '宮崎県' => ['県北', '県央', '県西', '県南'],
    '鹿児島県' => ['鹿児島市', '指宿・南薩', '霧島・姶良', '北薩', '大隅', '離島（鹿児島）'],
    
    '沖縄県' => ['本島北部', '本島中部', '本東南部', '離島（沖縄）'],

];
